app/controllers/calendars_controller.rb

SELECT * FROM `calendars`
---
  def index
    @calendars = Calendar.all

SELECT * FROM `calendars` WHERE (`calendars`.`id` = 1)
---
  def show
    @calendar = Calendar.find(params[:id])

SELECT * FROM `calendars` WHERE (`calendars`.`id` = 1)
---
  def edit
    @calendar = Calendar.find(params[:id])

INSERT INTO `calendars` (`minute`, `created_at`, `event_id`, `month`, `updated_at`, `hour`, `day_of_week`, `day_of_month`) VALUES(NULL, '2010-01-11 07:22:42', NULL, NULL, '2010-01-11 07:22:42', NULL, NULL, NULL)
---
  def create

    @calendar = Calendar.new(params[:calendar])

    respond_to do |format|
      if @calendar.save

SELECT * FROM `calendars` WHERE (`calendars`.`id` = 1)
UPDATE `calendars` SET `updated_at` = '2010-01-11 14:58:08', `event_id` = 2 WHERE `id` = 1
---
  def update
    @calendar = Calendar.find(params[:id])
    puts params[:calendar]
    respond_to do |format|
      if @calendar.update_attributes(params[:calendar])

SELECT * FROM `calendars` WHERE (`calendars`.`id` = 980190962)
DELETE FROM `calendars` WHERE `id` = 980190962
---
  def destroy
    @calendar = Calendar.find(params[:id])
    @calendar.destroy