app/controllers/events_controller.rb

INSERT INTO `events` (`created_at`, `title`, `updated_at`, `description`) VALUES('2010-01-10 16:10:51', '123', '2010-01-10 16:10:51', '132')
---
  def create
    @event = Event.new(params[:event])

    respond_to do |format|
      if @event.save

SELECT * FROM `events` WHERE (`events`.`id` = 980190962)
---
  def update
    @event = Event.find(params[:id])

SELECT * FROM `events` WHERE (`events`.`id` = 980190962)
DELETE FROM `events` WHERE `id` = 980190962
---
  def destroy
    @event = Event.find(params[:id])
    @event.destroy