app/controllers/registration_controller.rb

  def singlein
    @user         = User.new(params[:user])

    if request.post? and @user.save
---
INSERT INTO `users` (`name`, `salt`, `created_at`, `updated_at`, `hashed_password`, `reg`, `email`) VALUES('newUser', '-6126224880.49082626423292', '2010-01-10 10:39:19', '2010-01-10 10:39:19', 'fce1fe5d31bb43c0a62fc62410c381a8613e0f85', NULL, 'kazantsev.nickolay@gmail.com')