app/controllers/users_controller.rb

  def show
    @user = User.find(params[:id])
---
SELECT * FROM `users` WHERE (`users`.`id` IS NULL) LIMIT 1

  def edit
    @user = User.find(params[:id])
---
SELECT * FROM `users` WHERE (`users`.`id` IS NULL) LIMIT 1

  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO `users` (`name`, `salt`, `created_at`, `updated_at`, `hashed_password`, `reg`, `email`) VALUES('123', '123', '2010-01-10 09:18:36', '2010-01-10 09:18:36', '123', NULL, '123')

  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])
---
SELECT * FROM `users` WHERE (`users`.`id` IS NULL) LIMIT 1
UPDATE `users` SET `updated_at` = '2010-01-10 08:32:38', `email` = '123@qwe.ru' WHERE `id` = 1

  def destroy
    @user = User.find(params[:id])
    @user.destroy
---
SELECT * FROM `users` WHERE (`users`.`id` IS NULL) LIMIT 1
DELETE FROM `users` WHERE `id` = 980190962